ubnt-Alexey-Kuvshinov/stm32projects/LoRaAsset2/src/stm32L052x_board.c
	LL_I2C_Disable(I2C1);												//Disable I2C1 prior to modifying configuration registers

	//Timing register value is computed with the AN4235 xls file, fast Mode @400kHz with I2CCLK = 16MHz, rise time = 100ns, fall time = 10ns
	I2C1->TIMINGR = (uint32_t)0x00301019;	//0x000090f0;	//0x00B1112E;	//0x00B1112E;	0x00300619

//	LL_I2C_Enable(I2C1);
	accelerometerData.buffer[0] = AR_TEMP_CFG_REG;
	accelerometerData.buffer[1] = 0b11000000;							//enable temperature sensor
	accelerometerData.buffer[2] = 0b00100111;							//CTRL_REG1: HR / Normal / Low-power mode (10 Hz), Z, Y, X axis enabled
	AccelerometerWriteBytes(accelerometerData.buffer, 3);

	accelerometerData.buffer[0] = AR_CTRL_REG4;
	accelerometerData.buffer[1] = 0b10000000;							//set Block data update bit for temperature sensor
	AccelerometerWriteBytes(accelerometerData.buffer, 2);

	accelerometerData.buffer[0] = AR_CTRL_REG3;
//	accelerometerData.buffer[1] = 0b01100000;							//IA1 interrupt on INT1 pin, IA2 interrupt on INT1 pin
	accelerometerData.buffer[1] = 0b01000000;							//IA1 interrupt on INT1 pin
	AccelerometerWriteBytes(accelerometerData.buffer, 2);

//seems not needed
//	accelerometerData.buffer[0] = AR_CTRL_REG5;
//	//accelerometerData.buffer[1] = 0b00001110;							//Reboot memory content, Latch interrupt request on INT1_SRC (31h), with INT1_SRC (31h) register cleared by reading INT1_SRC (31h) itself
//	accelerometerData.buffer[1] = 0b00000000;
//	AccelerometerWriteBytes(accelerometerData.buffer, 2);

	accelerometerData.buffer[0] = AR_INT1_CFG;
//	accelerometerData.buffer[1] = 0b01111111;							//6-direction movement recognition
	accelerometerData.buffer[1] = 0b10010101;							//free fall movement recognition
	AccelerometerWriteBytes(accelerometerData.buffer, 2);

	accelerometerData.buffer[0] = AR_INT1_THS;
//	accelerometerData.buffer[1] = 0b00111000;							//interrupt threshold
	accelerometerData.buffer[1] = 0b00100000;							//interrupt threshold
	accelerometerData.buffer[2] = 0b00000001;							//interrupt duration
	AccelerometerWriteBytes(accelerometerData.buffer, 3);

	LL_SYSCFG_SetEXTISource(LL_SYSCFG_EXTI_PORTA, LL_SYSCFG_EXTI_LINE0);//Select Port A for EXTI0 line input source
	LL_EXTI_EnableRisingTrig_0_31(EXTI_IMR_IM0);						//Rising trigger event configuration bit of line 0
	LL_EXTI_EnableIT_0_31(EXTI_IMR_IM0);								//enable EXTI0 line interrupt
	NVIC_SetPriority(EXTI0_1_IRQn, GPIO_PRIORITY);						//enable button interrupts in interrupt controller
	NVIC_EnableIRQ(EXTI0_1_IRQn);

	LL_SYSCFG_SetEXTISource(LL_SYSCFG_EXTI_PORTB, LL_SYSCFG_EXTI_LINE2);//Select Port B for EXTI2 line input source
	LL_EXTI_EnableRisingTrig_0_31(EXTI_IMR_IM2);						//Rising trigger event configuration bit of line 2
	LL_EXTI_EnableIT_0_31(EXTI_IMR_IM2);								//enable EXTI2 line interrupt
	NVIC_SetPriority(EXTI2_3_IRQn, GPIO_PRIORITY);						//enable button interrupts in interrupt controller
	NVIC_EnableIRQ(EXTI2_3_IRQn);
}


void configureUart(USARTx base, uint32_t speed)
{
	USART_ptr(base)->CR1 &=  ~USART_CR1_UE;								//disable UART in order to program
//	USART_ptr(base)->BRR = 0x8A;										//115200 baud from 16MHz HSI, should it be 8B? guess was tried with experimental clocks match
	USART_ptr(base)->BRR = speed;										//baud rate from 16MHz HSI (16MHz / (16 * div), div has last four bits as fractional part expressed in 1/16th)
	USART_ptr(base)->CR1 |= USART_CR1_UESM | USART_CR1_RXNEIE;			//Enable UART in STOP Mode and interrupt on character reception, also used for wake up from Stop Mode
//	USART_ptr(base)->CR3 |= USART_CR3_UCESM;							//Clock Enable in Stop mode *feature removed in 2015
	USART_ptr(base)->CR1 |= USART_CR1_UE | USART_CR1_RE | USART_CR1_TE;	//enable UART, UART receiver and UART transmitter
}

static void inline configureUart1(void)
{
	LL_RCC_SetUSARTClockSource(LL_RCC_USART1_CLKSOURCE_HSI);			//would not wake up from Stop if clock source is not set to HSI
	configurePortPinAsAf(UART1_TX_PORT, UART1_TX_BIT, GPIO_AF_4);	 	//configure UART TX GPIO
	configurePortPinAsAf(UART1_RX_PORT, UART1_RX_BIT, GPIO_AF_4);		//configure UART RX GPIO
	configureUart(USART_1, US_USART_115200);							//configure UART communication parameters 115200
	NVIC_SetPriority(USART1_IRQn, USART_2_PRIORITY);					//enable UART2 interrupt in interrupt controller
	NVIC_EnableIRQ(USART1_IRQn);
}

static void inline configureUart2(void)
{
	LL_RCC_SetUSARTClockSource(LL_RCC_USART2_CLKSOURCE_HSI);
	configurePortPinAsAf(UART2_TX_PORT, UART2_TX_BIT, GPIO_AF_4);		//configure UART TX GPIO
	configurePortPinAsAf(UART2_RX_PORT, UART2_RX_BIT, GPIO_AF_4);		//configure UART RX GPIO
	configureUart(USART_2, US_USART_14400);								//configure UART communication parameters 14400
	NVIC_SetPriority(USART2_IRQn, USART_2_PRIORITY);					//enable UART2 interrupt in interrupt controller
	NVIC_EnableIRQ(USART2_IRQn);
}

static void inline configureLpUart(void)
{
	LL_RCC_SetLPUARTClockSource(LL_RCC_LPUART1_CLKSOURCE_HSI);
	configurePortPinAsAf(LPUART_TX_PORT,LPUART_TX_BIT, GPIO_AF_4);		//configure UART TX GPIO
	configurePortPinAsAf(LPUART_RX_PORT,LPUART_RX_BIT, GPIO_AF_4);		//configure UART RX GPIO
//	configureUart(LPUART, 426667);										//configure LPUART communication parameters 9600
	configureUart(LPUART, US_LPUART_115200);							//configure LPUART communication parameters 115200
	NVIC_SetPriority(LPUART1_IRQn, USART_2_PRIORITY);					//enable LPUART interrupt in interrupt controller
	NVIC_EnableIRQ(LPUART1_IRQn);
}


static void inline configureSpi1(void)
{
	configurePortPinAsAf(RADIO_MOSI_PORT, RADIO_MOSI_BIT, GPIO_AF_0);	//master out slave in GPIO
	configurePortPinAsAf(RADIO_MISO_PORT, RADIO_MISO_BIT, GPIO_AF_0);	//master in slave out GPIO
	configurePortPinAsAf(RADIO_SCK_PORT, RADIO_SCK_BIT, GPIO_AF_0);		//clock GPIO
	configurePortPinPullDown(RADIO_SCK_PORT, RADIO_SCK_BIT);			//pull clock line down for CPOL=0
	setPortBit(RADIO_NSS_PORT, RADIO_NSS_BIT);							//deactivate NSS line

	SPI1->CR1 &= ~SPI_CR1_SPE;											//disable SPI1 in order to program
	SPI1->CR1 |= HALF_PERIPHERAL_CLOCK << SPI_CR1_BR_Pos				//8MHz from 16MHz peripheral clock
			 | SPI_CR1_MSTR												//SPI1 will be master
			 | SPI_CR1_SSM												//Software slave management
			 | SPI_CR1_SSI;												//internal slave select to avoid MODF error
	SPI1->CR1 |= SPI_CR1_SPE;											//enable SPI1
}


static inline void enableRTC(void)
{
	LL_PWR_EnableBkUpAccess();											//Enable access to the backup domain
	while(!LL_PWR_IsEnabledBkUpAccess());
	LL_RCC_LSE_Enable();												//Enable LSE
	while(!LL_RCC_LSE_IsReady());										//wait for LSE to become ready
	LL_RCC_SetRTCClockSource(LL_RCC_RTC_CLKSOURCE_LSE);					//set LSE as RTC clock
	LL_RCC_EnableRTC();													//at last, enable RTC

	LL_RTC_DisableWriteProtection(RTC);
//	LL_RTC_EnableShadowRegBypass(RTC);
	LL_RTC_DisableShadowRegBypass(RTC);

