ubnt-Alexey-Kuvshinov/stm32projects/LoRaAsset2/src/stm32L052x_board.c
	//configure prescalers such that subseconds tick would be 1/1024th of a second i.e. ~1ms
	if((LL_RTC_GetAsynchPrescaler(RTC) != 31) || (LL_RTC_GetSynchPrescaler(RTC) != 1023))
	{
		LL_RTC_EnableInitMode(RTC);
		while(!LL_RTC_IsActiveFlag_INIT(RTC));
		LL_RTC_SetSynchPrescaler(RTC, (uint32_t)1023);					//ck_spre=ck_apre/(SYNC prediv + 1)
		LL_RTC_SetAsynchPrescaler(RTC, (uint32_t)31);					//ck_apre=LSEFreq/(ASYNC prediv + 1) = 1024Hz with LSEFreq=32768Hz
		LL_RTC_DisableInitMode(RTC);
	}

	//RTC alarm A configuration
	LL_RTC_ALMA_Disable(RTC);
	RTC->ISR = ~(RTC_ISR_ALRAF | RTC_ISR_INIT) | (RTC->ISR & RTC_ISR_INIT);	//Clear the AlarmA interrupt pending bit
	while(!LL_RTC_IsActiveFlag_ALRAW(RTC));
	LL_RTC_EnableIT_ALRA(RTC);											//enable Alarm A interrupt
//	LL_RTC_ALMA_Enable(RTC);											//enable Alarm A

	//RTC alarm B configuration
	LL_RTC_ALMB_Disable(RTC);
	RTC->ISR = ~(RTC_ISR_ALRBF | RTC_ISR_INIT) | (RTC->ISR & RTC_ISR_INIT);		//Clear the AlarmB interrupt pending bit
	while(!LL_RTC_IsActiveFlag_ALRBW(RTC));
	LL_RTC_ALMB_SetMask(RTC, RTC_ALRMBR_MSK4 | RTC_ALRMBR_MSK3);		//trigger when minutes, seconds and subseconds match
	LL_RTC_ALMB_SetSubSecondMask(RTC, 10);								//0 - 1023, compare 10 bits of sub second value (1 bit ~= 1ms) for alarm event
	LL_RTC_EnableIT_ALRB(RTC);											//enable Alarm B interrupt
//	LL_RTC_ALMB_Enable(RTC);											//enable Alarm B

//	LL_RTC_EnableWriteProtection(RTC);

	//After a system reset, the software must wait until RSF is set before reading the RTC_SSR RTC_TR and RTC_DR
	while(!LL_RTC_IsActiveFlag_RS(RTC));

	LL_EXTI_EnableRisingTrig_0_31(EXTI_IMR_IM17);						//connect RTC Alarm to EXTI line
	LL_EXTI_EnableIT_0_31(EXTI_IMR_IM17);

	NVIC_SetPriority(RTC_IRQn, ALARM_PRIORITY);							//enable RTC Alarms interrupts in interrupt controller
	NVIC_EnableIRQ(RTC_IRQn);
}


static inline void enableLPTim(void)
{
	LL_RCC_SetLPTIMClockSource(LL_RCC_LPTIM1_CLKSOURCE_LSE);			//32.768kHz
	//LL_LPTIM_SetPrescaler(LPTIM1, LL_LPTIM_PRESCALER_DIV32);			//~1ms clock 1/1024s
	LL_LPTIM_SetPrescaler(LPTIM1, LL_LPTIM_PRESCALER_DIV8);
	LL_LPTIM_EnableTimeout(LPTIM1);										//enable wake-up
	LL_LPTIM_EnableIT_CMPM(LPTIM1);										//Enable Compare match interrupt

	LL_LPTIM_Enable(LPTIM1);											//Enable LPTIM
	LL_LPTIM_SetAutoReload(LPTIM1, 0xFFFF);								//Load the period value has to be strictly bigger than compare value

	LL_EXTI_EnableIT_0_31(LL_EXTI_LINE_29);
	LL_EXTI_EnableRisingTrig_0_31(LL_EXTI_LINE_29);						//connect LPTIM to EXTI line

	NVIC_SetPriority(LPTIM1_IRQn, LPTIMER_PRIORITY);

	LL_LPTIM_SetAutoReload(LPTIM1, 3);
	LL_LPTIM_SetCompare(LPTIM1,2);
	LL_LPTIM_StartCounter(LPTIM1, LL_LPTIM_OPERATING_MODE_CONTINUOUS);

	NVIC_EnableIRQ(LPTIM1_IRQn);
}


static inline void configureRadio(void)
{
	LL_SYSCFG_SetEXTISource(LL_SYSCFG_EXTI_PORTB, LL_SYSCFG_EXTI_LINE12);//Connect DIO0 pin to EXTI12 line
	LL_EXTI_EnableRisingTrig_0_31(EXTI_IMR_IM12);						//configure EXTI12 for rising trigger interrupt
	LL_EXTI_EnableIT_0_31(EXTI_IMR_IM12);								//enable line 12 interrupt in EXTI

	LL_SYSCFG_SetEXTISource(LL_SYSCFG_EXTI_PORTB, LL_SYSCFG_EXTI_LINE15);//Connect DIO3 pin to EXTI15 line
	LL_EXTI_EnableRisingTrig_0_31(EXTI_IMR_IM15);						//configure EXTI15 for rising trigger interrupt
	LL_EXTI_EnableIT_0_31(EXTI_IMR_IM15);								//enable line 15 interrupt in EXTI
	NVIC_SetPriority(EXTI4_15_IRQn, GPIO_PRIORITY);						//enable the EXTI lines interrupt in interrupt controller
	NVIC_EnableIRQ(EXTI4_15_IRQn);

	setPortBit(RADIO_RESET_PORT, RADIO_RESET_BIT);						//turn on the radio chip TODO: remove
}


void init_Board_Peripherals(void)
{
	//enable peripherals
	LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOA);					//enable port A
	LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOB);					//enable port B
	LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOC);					//enable port C
	LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SYSCFG);				//enable system configuration or writing to SYSCFG has no effect
	LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART1);				//enable UART1 peripheral
	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART2);				//enable UART2 peripheral
	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_LPUART1);				//enable LPUART1 peripheral
	LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SPI1);					//enable SPI1 peripheral
	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_LPTIM1);				//enable low-power timer
	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C1);					//Enable the peripheral clock for I2C1

	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_PWR);					//enable debug interface
	LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_DBGMCU);
	LL_DBGMCU_EnableDBGStopMode();
	LL_DBGMCU_EnableDBGStandbyMode();
	LL_DBGMCU_ABP1_GRP1_FreezePeriph(LL_DBGMCU_ABP1_GRP1_RTC_STOP | LL_DBGMCU_ABP1_GRP1_LPTIM1_STOP | LL_DBGMCU_ABP1_GRP1_I2C1_STOP);

	//configure inputs
	for(tmp = 0; tmp < sizeof(inputs) / sizeof(struct GPIO_Line); tmp++)
		configurePortPinAsInput(inputs[tmp].port, inputs[tmp].bit);

	//configure outputs
	setPortBit(RADIO_RESET_PORT, RADIO_RESET_BIT);

	for(tmp = 0; tmp < sizeof(outputs) / sizeof(struct GPIO_Line); tmp++)
		configurePortPinAsOutput(outputs[tmp].port, outputs[tmp].bit);

	configureUart1();													//configure command interface

	configureUart2();													//configure camera interface

	configureLpUart();													//configure GPS interface

	configureSpi1();													//configure radio communication interface

    enableRTC();														//start RTC, clock source is actually set for the first time only, then proper RTC domain reset is needed to change it

	enableLPTim();														//LSE is enabled by enableRTC();

	configureAccelerometer();

	configureRadio();													//connect radio interrupts and enable the radio

	sendUart1Message("$PMTK161,0*28\r\n", 15);							//put GPS into low-power mode
}


//Timeout range is from 1 to FFFF 1/1024s => ~ 1ms - 1min, event is the flag to be set when timer expires
void setTimer(uint16_t timeout, uint16_t event)
{
	uint32_t i;
//	uint16_t delta = 0;

