ubnt-Alexey-Kuvshinov/stm32projects/LoRaAsset2/src/stm32L052x_board.c
	NVIC_DisableIRQ(LPTIM1_IRQn);

	//find a place in scheduling table to insert a new event into
	for(i = 0; i < TIMER_SCHEDULE_SIZE; i++)
		if(timerSchedule[i].event == event)
			break;

	if(TIMER_SCHEDULE_SIZE == i)											//no such event was previously scheduled, find first empty entry for it
		for(i = 0; i < TIMER_SCHEDULE_SIZE; i++)
			if(0 == timerSchedule[i].event)
				break;		  												//empty entry should always exist so skipping check for the end here

	//here we have a position to insert new event into
	timerSchedule[i].event = event;

	//now let's see about the timing
	if (TimerCounter) {														//this means timer is running and counter register must be less than compare register

		if (timeout >= TimerCounter) {
			timerSchedule[i].timeout = timeout - TimerCounter;				//convert the timeout to timer terms
		} else {															//the new event will be first to expire
			timeout = TimerCounter - timeout;								//now use timeout as delta holder, - other scheduled events timeouts need to be increased by this much
			TimerCounter -= timeout;										//schedule the new event with original timout value
			timerSchedule[i].timeout = 0 - timeout;							//to become 0 after following expire time updating loop
			for (i = 0; i < TIMER_SCHEDULE_SIZE; i++)
				timerSchedule[i].timeout += timeout;
		}
	} else {																//scheduling table must be empty, the easy case
		timerSchedule[i].timeout = 0;
		TimerCounter = timeout;
	}

	HardwareEvents &= ~event;

	NVIC_EnableIRQ(LPTIM1_IRQn);
}


void startLpUartMsg(uint8_t command)
{
	while(HardwareEvents & HWE_LPUART_TRANSMITTING);					//make sure not to screw up a message that may be currently in progress
	LpUartTx.size = 1;													//reserve space for message length
	LpUartTx.data[LpUartTx.size++] = command;
}

void addToLpUartMsg(uint8_t byte)
{
	if(LpUartTx.size >= sizeof(LpUartTx.data))
		ErrorHandler("addToUart2Msg() error");
	else
		LpUartTx.data[LpUartTx.size++] = byte;
}

void sendLpUartMessage(void)
{
	HardwareEvents |= HWE_LPUART_TRANSMITTING;							//uart transmission is in progress
	LpUartTx.data[0] = LpUartTx.size;									//number of bytes in a message including first length byte
	LpUartTx.counter = 0;												//TX buffer should be filled and size properly set
	USART_ptr(LPUART)->CR1 |= USART_CR1_TCIE;							//enable transfer complete interrupt initiating interrupt - driven transmission
}

void lpUartSendText(char *text)
{
	while(HardwareEvents & HWE_LPUART_TRANSMITTING);
	startLpUartMsg(RC_TEXT);

	LpUartTx.size = strlen(text);
	if(LpUartTx.size > sizeof(LpUartTx.data) - 2)
		LpUartTx.size = sizeof(LpUartTx.data) - 2;
	memcpy(LpUartTx.data + 2, text, LpUartTx.size);
	LpUartTx.size += 2;
	sendLpUartMessage();
}



void sendUart2Message(uint8_t *data, uint8_t length)
{
	while(HardwareEvents & HWE_UART2_TRANSMITTING);
	HardwareEvents |= HWE_UART2_TRANSMITTING;							//uart transmission is in progress
	if(length > sizeof(Uart2Tx.data))
		length = sizeof(Uart2Tx.data);
	memmove(Uart2Tx.data, data, length);
	Uart2Tx.size = length;												//number of bytes in a message including first length byte
	Uart2Tx.counter = 0;												//TX buffer should be filled and size properly set
	USART_ptr(USART_2)->CR1 |= USART_CR1_TCIE;							//enable transfer complete interrupt initiating interrupt - driven transmission
}

void sendUart1Message(uint8_t *data, uint8_t length)					//send a command to GPS
{
	while(HardwareEvents & HWE_UART1_TRANSMITTING);
	HardwareEvents |= HWE_UART1_TRANSMITTING;							//uart transmission is in progress
	if(length > sizeof(Uart1Tx.data))
		length = sizeof(Uart1Tx.data);
	memmove(Uart1Tx.data, data, length);
	Uart1Tx.size = length;												//number of bytes in a message including first length byte
	Uart1Tx.counter = 0;												//TX buffer should be filled and size properly set
	USART_ptr(USART_1)->CR1 |= USART_CR1_TCIE;							//enable transfer complete interrupt initiating interrupt - driven transmission
}

void spiAccessRegisters(uint8_t *data, uint8_t length)
{
	resetPortBit(RADIO_NSS_PORT, RADIO_NSS_BIT);						//start SPI transaction - assert data frame start

	(void)SPI1->DR;														//read and discard RX buffer to clear RXNE, just in case
	while(length--)
	{
		SPI1->DR = *data;												//write a data byte
		while(0 == (SPI1->SR & SPI_SR_RXNE));							//wait until reply is ready
		*(data++) = SPI1->DR;											//save the reply. * Address byte will be overwritten with 0
	}

	setPortBit(RADIO_NSS_PORT, RADIO_NSS_BIT);							//end SPI access - deactivate NSS line
}

void spiAccessRegisters2(uint8_t command, uint8_t *data, uint8_t length)
{
	resetPortBit(RADIO_NSS_PORT, RADIO_NSS_BIT);						//assert data frame start

	(void)SPI1->DR;														//read and discard RX buffer to clear RXNE, just in case

	SPI1->DR = command;													//send the address with the Write bit indicator
	while(0 == (SPI1->SR & SPI_SR_RXNE));								//wait until address transmits
	(void)SPI1->DR;														//discard dummy return, otherwise next byte returned would be lost

	while(length--)
	{
		SPI1->DR = *data;												//write a data byte
		while(0 == (SPI1->SR & SPI_SR_RXNE));							//wait until reply is ready
		*(data++) = SPI1->DR;											//save the reply
	}

	setPortBit(RADIO_NSS_PORT, RADIO_NSS_BIT);							//deactivate NSS line
}


//the stop parameter should be zero if i2cRead is called right after i2cWrite, to generate restart condition
int i2cWrite(uint8_t *data, uint8_t length, uint8_t stop)
{
	LL_I2C_SetSlaveAddr(I2C1, ACCELEROMETER_I2C_ADDRESS);
	LL_I2C_SetTransferSize(I2C1, length);
	LL_I2C_SetTransferRequest(I2C1, LL_I2C_REQUEST_WRITE);
	LL_I2C_GenerateStartCondition(I2C1);								//Initiate a Start condition to the Slave device

	while(!LL_I2C_IsActiveFlag_TC(I2C1)) {								//wait until length bytes are transmitted
		if(LL_I2C_IsActiveFlag_NACK(I2C1))
			return 0;
//		if(LL_I2C_IsActiveFlag_TXE(I2C1))
		if(LL_I2C_IsActiveFlag_TXIS(I2C1))
			LL_I2C_TransmitData8(I2C1, *data++);
	}

	if(stop) {
		LL_I2C_GenerateStopCondition(I2C1);								//Generate Stop condition
		while(!LL_I2C_IsActiveFlag_STOP(I2C1));							//wait until the stop appears on I2C bus
	}

	return 1;
}


void i2cRead(uint8_t *data, uint8_t length)
{
	LL_I2C_SetSlaveAddr(I2C1, ACCELEROMETER_I2C_ADDRESS);
	LL_I2C_SetTransferSize(I2C1, length);
	LL_I2C_SetTransferRequest(I2C1, LL_I2C_REQUEST_READ);
	LL_I2C_GenerateStartCondition(I2C1);								//Initiate a Start condition to the Slave device

	//here master is in receive mode activated by I2C_REQUEST_READ bit
	while(length)														//receive data
		if(LL_I2C_IsActiveFlag_RXNE(I2C1)) {							//Check RXNE flag value in ISR register and read next data byte
			*data++ = LL_I2C_ReceiveData8(I2C1);						//Read data in Receive Data register. RXNE flag is cleared by reading data from RXDR register
			length--;
		}

//	if(LL_I2C_IsActiveFlag_TC(I2C1))

	LL_I2C_GenerateStopCondition(I2C1);									//and Stop condition after receiving next byte
	while(!LL_I2C_IsActiveFlag_STOP(I2C1));								//wait until the stop appears on I2C bus

//	return 0;
}



inline void boardGreenLedOn(void)
{
	setPortBit(AUX_GREEN_LED_PORT, AUX_GREEN_LED_BIT);
}

inline void boardGreenLedOff(void)
{
	resetPortBit(AUX_GREEN_LED_PORT, AUX_GREEN_LED_BIT);
}

void boardGreenLedToggle(void)
{
	if(readPortBit(AUX_GREEN_LED_PORT, AUX_GREEN_LED_BIT))
		boardGreenLedOff();
	else
		boardGreenLedOn();
}

inline void boardWhiteLedOn(void)
{
	setPortBit(AUX_WHITE_LED_PORT, AUX_WHITE_LED_BIT);
}

