ubnt-Alexey-Kuvshinov/stm32projects/LoRaAsset2/src/stm32L052x_board.c
inline void boardWhiteLedOff(void)
{
	resetPortBit(AUX_WHITE_LED_PORT, AUX_WHITE_LED_BIT);
}

void boardWhiteLedToggle(void)
{
	if(readPortBit(AUX_WHITE_LED_PORT, AUX_WHITE_LED_BIT))
		boardWhiteLedOff();
	else
		boardWhiteLedOn();
}

inline void boardRedLedOn(void)
{
	setPortBit(AUX_RED_LED_PORT, AUX_RED_LED_BIT);
}

inline void boardRedLedOff(void)
{
	resetPortBit(AUX_RED_LED_PORT, AUX_RED_LED_BIT);
}

void boardRedLedToggle(void)
{
	if(readPortBit(AUX_RED_LED_PORT, AUX_RED_LED_BIT))
		boardRedLedOff();
	else
		boardRedLedOn();
}


void driveGreenLed(uint8_t high_low)
{
	if(high_low)
		boardGreenLedOn();
	else
		boardGreenLedOff();
}

void driveRedLed(uint8_t high_low)
{
	if(high_low)
		boardRedLedOn();
	else
		boardRedLedOff();
}

void driveRfSwitch(uint8_t switches)
{
	if(switches & 0b100)												//sets RF output: Low - RFO_HF, High - PA_BOOST
		setPortBit(RF_PA_HIGH_PWR_PORT, RF_PA_HIGH_PWR_BIT);
	else
		resetPortBit(RF_PA_HIGH_PWR_PORT, RF_PA_HIGH_PWR_BIT);

	if(switches & 0b010)
		setPortBit(RF_CPS_PORT, RF_CPS_BIT);							//sets gain control in receive mode: Low - receive low gain, High - receive high gain
	else
		resetPortBit(RF_CPS_PORT, RF_CPS_BIT);

	if(switches & 0b001)												//Shutdown control: Low - turned off, High - RX or TX is enabled
		setPortBit(RF_CSD_PORT, RF_CSD_BIT);
	else
		resetPortBit(RF_CSD_PORT, RF_CSD_BIT);
}


void enterSleep(void)
{
	LL_PWR_ClearFlag_WU();												//ensure that the WUF  wake up flag is cleared
	LL_LPM_EnableDeepSleep();											//Set SLEEPDEEP bit of Cortex System Control Register
	__WFI();															//Request Wait For Interrupt
	//TODO: is it necessary?
//	CLEAR_BIT(SCB->SCR, SCB_SCR_SLEEPDEEP_Msk);							//Reset SLEEPDEEP bit after exiting from Stop
}


void enterStandby(void)
{
	lpUartSendText("Bye, going to StandBy");
	while(HardwareEvents & HWE_LPUART_TRANSMITTING);					//wait until the message transmits

	LL_PWR_ClearFlag_WU();
	LL_PWR_ClearFlag_SB();
//	LL_PWR_EnableWakeUpPin(LL_PWR_WAKEUP_PIN2);
	LL_PWR_EnableWakeUpPin(LL_PWR_WAKEUP_PIN1);
	LL_LPM_EnableDeepSleep();
	LL_PWR_SetPowerMode(LL_PWR_MODE_STANDBY);

	__SEV();
	__WFE();
	__WFE();
}


//This function is executed in case of error occurrence
void ErrorHandler(char *msg)
{
	boardRedLedOn();
	lpUartSendText(msg);
	while(1);
}

#ifdef  USE_FULL_ASSERT
//Reports the name of the source file and the source line number where the assert_param error has occurred
void assert_failed(uint8_t* file, uint32_t line)
{
//User can add his own implementation to report the file name and line number, ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line)
	while (1);
}
#endif
